{
    "posts": [
        {
            "authorProfile": "https://www.reddit.com/user/flyondawalll",
            "authorId": "t2_18m8yiqqtd",
            "title": "Uwaterloo filed action against my stupid little merch lol",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j8wytt/uwaterloo_filed_action_against_my_stupid_little/",
            "body": "5 years ago I made faculty stickers during Covid for fun and sold them on redbubble, never said university of Waterloo on them. Today I got complaint from the university that my artwork violates their rights got my money removed from my account and banned from positing on redbubble. “It is important that users of the Redbubble marketplace only upload their own original artwork.”\n\nI know I made like 10 cents a sticker but still wtf😭 they’re that stingy ?? I made the font , the art , the stupid lil illustrations. If you go on redbubble so much uw merch is on there. Don’t innovate at the most innovative university I guess lmao.",
            "subreddit": "uwaterloo",
            "publishingDate": 1741715672.0,
            "postId": "t3_1j8wytt",
            "postLabel": "",
            "postUpvotes": 521,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 43,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Cheap_Trust3043",
            "authorId": "t2_1ja6rglmrl",
            "title": "Bro why is this school trending globally 😭",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jb9oom/bro_why_is_this_school_trending_globally/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1741973945.0,
            "postId": "t3_1jb9oom",
            "postLabel": "",
            "postUpvotes": 498,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 20,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Certain_Log2871",
            "authorId": "t2_1fv23twnnw",
            "title": "This is my invincible OC his name is unemployable",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jmwoxm/this_is_my_invincible_oc_his_name_is_unemployable/",
            "body": "instead of fighting conquest he fights for an internship on LinkedIn ",
            "subreddit": "uwaterloo",
            "publishingDate": 1743283595.0,
            "postId": "t3_1jmwoxm",
            "postLabel": "",
            "postUpvotes": 439,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 7,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/WeOutHereIndoors",
            "authorId": "t2_56dw3dql",
            "title": "I miss university",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j804lm/i_miss_university/",
            "body": "Been out of school for 7 years now, time is a bitch. Have a good job, good social life and a great girlfriend. All in all my life is good. \n\nWaterloo wasn’t always the best environment for a social life to thrive. People were competitive, some in a super dickhead kind of way, and everyone was always studying. I hope the campus now is more social and inviting than when I was a student. \n\nBut man, I just miss when my biggest stress was passing an exam. I miss hanging out with my friends all night and just laughing. I miss going out multiple nights a week. I miss seeing my friends EVERYDAY. I know a lot of people in this group worry about co-ops, and their grades and all that stuff which is important. But these are gonna be some great years of your life, some of the best if you want them to. Go out more, put yourself out there, say yes instead of no, study LESS.\n\n\nLooking back now, I never wished that I studied more, worked harder, or even tried harder. I wish that I went out more, stayed out later, stayed up longer because that’s what you remember. I look back at my Snapchat memories and smile, just wish that I had more of them. You remember the moments, not whether or not you passed ur fucking exam (granted the all nighters study sessions with the homies were always hilarious). \n\nIf you’re still in school, make the most of it. Grades are important but you’ll never be 18-22 with your friends again. There will come a time where the people you see everyday, you see maybe once a month. The friends you have now won’t be the friends you have later, the love won’t be lost, life just gets in the way. \n\nTo my former and current Warriors, have some fucking fun. \n\n",
            "subreddit": "uwaterloo",
            "publishingDate": 1741617556.0,
            "postId": "t3_1j804lm",
            "postLabel": "",
            "postUpvotes": 431,
            "ratio": 0.98,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 25,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/pacman-ty",
            "authorId": "t2_1lxrmns03y",
            "title": "Another angel has lost its wings &lt;/3",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jkq1pb/another_angel_has_lost_its_wings_3/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1743031842.0,
            "postId": "t3_1jkq1pb",
            "postLabel": "",
            "postUpvotes": 380,
            "ratio": 0.98,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 24,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/friedrice759",
            "authorId": "t2_be59yjjl",
            "title": "midnight vibes",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j9k9dk/midnight_vibes/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1741786659.0,
            "postId": "t3_1j9k9dk",
            "postLabel": "Photo/Video",
            "postUpvotes": 363,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 14,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Toshiba_FAQ",
            "authorId": "t2_synnx1wlq",
            "title": "Concern about campus",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jmmk00/concern_about_campus/",
            "body": "Just wondering if this is supposed to be like this? If someone tries crossing the bridge they are gonna fall and probably get hurt pretty badly. Why is nobody talking about this?",
            "subreddit": "uwaterloo",
            "publishingDate": 1743255763.0,
            "postId": "t3_1jmmk00",
            "postLabel": "Discussion",
            "postUpvotes": 351,
            "ratio": 0.96,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 21,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Individual_Price2745",
            "authorId": "t2_1fwpfg7cu2",
            "title": "MC-DC (and MC-M3) Bridge Funeral",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jfhyez/mcdc_and_mcm3_bridge_funeral/",
            "body": "I know we are all still heartbroken by the loss of our favourite campus bridge, and the MC-M3 one, so that’s why I’m planning to hold a joint funeral for them on March 20th at 12pm. It will be located on the MC 3rd floor where the MC-DC bridge entrance was. If anyone has some unprocessed emotions or wants to pay respects, please join us.\n\nWe can put up some posters, say a few words and share our favourite memories of the bridge(s). Feel free to bring flowers, candles (or Dollarama tea lights), and your loved ones. You can also come later to pay your respects and leave a message. We should all band together during these trying times. They were taken from us too soon. Never forget.\n\nPS. Please join, let's put the fun in funeral!",
            "subreddit": "uwaterloo",
            "publishingDate": 1742449064.0,
            "postId": "t3_1jfhyez",
            "postLabel": "",
            "postUpvotes": 326,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 13,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/[deleted]",
            "authorId": "",
            "title": "Hero at Waterloo",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jh3t62/hero_at_waterloo/",
            "body": "I never thought I would ever get reddit just for this day, but here we are. I just wanted to first off say thank you to the asian guy that saved our lives a few days ago. Out of respect to his parent's wishes after talking with them, I won't be saying his name out in public like this, but hopefully one day he might see this and know how thankful we are for someone like him. Me and my friends all owe our lives to this guy. While playing badminton in the gym at Guelph, a large piece of metal accidentally fell from the top floor and we were frozen in fear.\n\nThe guy jumped in front collided with the bar and even now I can still hear the sound of the impact even now. It sucks because like I feel so lucky, yet so sad and like I can't even sleep thinking about how he is doing and like why did it have to be just him taking the hit and not all of us collectively. We all feel terrible for what happened to him and when we heard about his condition we rushed to see him at the hospital to offer our thanks and apologies.\n\nWhen we arrived at the hospital it was too late and he entered into this unconscious comatose-like state and the doctor told us he is likely to have permanent nerve damage and impairment to his memory and personality. The worst part is I keep imaging different worlds in how maybe just maybe we could have helped him if we reacted faster or maybe we could have all just tried dodging the beam instead of standing like idiots, but now we think that he might never wake up and know what a difference he has made in our lives.\n\nEven after the incident, he walked it off before we could talk to him and the only thing he said to us was \"I'm going home\" and later on fell unconscious when he arrived home. We never got to know this guy and yet he jumped in the face of death for no reason and no offense I have been a Guelph girlie and always thought men at Waterloo are just creeps, but he honestly made a difference in my perspective and I don't think any amount of apologies can fix what he is currently going through.\n\nWe left gifts at the hospital for him, if he ever recovers to see them. He is a true hero at the core of his heart and if you ever see this just know that we pray that you get well soon. Your friends and loved ones are lucky to have you and we all wish the best 💜. You will always and forever be remembered by all of us.",
            "subreddit": "uwaterloo",
            "publishingDate": 1742631732.0,
            "postId": "t3_1jh3t62",
            "postLabel": "Serious",
            "postUpvotes": 310,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 18,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Syther19",
            "authorId": "t2_1qwxoevo",
            "title": "The geese are taking campus by force",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jm0i16/the_geese_are_taking_campus_by_force/",
            "body": "They’ve started gate keeping entrances of buildings ",
            "subreddit": "uwaterloo",
            "publishingDate": 1743182832.0,
            "postId": "t3_1jm0i16",
            "postLabel": "",
            "postUpvotes": 311,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 16,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Short_Mention",
            "authorId": "t2_5k08dh0p",
            "title": "I love April",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jps2q9/i_love_april/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1743609341.0,
            "postId": "t3_1jps2q9",
            "postLabel": "",
            "postUpvotes": 272,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 16,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/TheDuckAboveAll",
            "authorId": "t2_kexqtpd7x",
            "title": "SOUND THE DRUMS, THEYRE back!!!",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jp45j8/sound_the_drums_theyre_back/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1743535035.0,
            "postId": "t3_1jp45j8",
            "postLabel": "Shitpost",
            "postUpvotes": 274,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 13,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/lavvender_ice",
            "authorId": "t2_h0wm8s60",
            "title": "It's crazy how much less depressed I am now that the sun is out",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jbdghy/its_crazy_how_much_less_depressed_i_am_now_that/",
            "body": "The birds are chirping,  im passing my classes, life is actually worth living",
            "subreddit": "uwaterloo",
            "publishingDate": 1741984032.0,
            "postId": "t3_1jbdghy",
            "postLabel": "",
            "postUpvotes": 273,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 9,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/skrimpers",
            "authorId": "t2_agjbvdv6",
            "title": "Platforming ethno religious separatist groups",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jdg7gr/platforming_ethno_religious_separatist_groups/",
            "body": "I don't know if this is allowed, and I don't mean any hate, but I was just wondering why an ethno-religious separatist group (from another country!) is being promoted at u Waterloo?\n\nThe Khalistan movement in the 1980s and 1990s became associated with violence, terrorism, and militancy. Support for the movement in public universities could inadvertently promote extremism or embolden those advocating violent methods to achieve political goals. Universities should be places where peaceful dialogue and critical thought are encouraged, rather than platforms for potentially violent separatist movements. Promoting the movement could fuel tensions among students, disrupt campus life, and possibly even incite conflict or hatred, especially in diverse multicultural settings.\n\nWhile academic freedom is crucial, universities have a responsibility to ensure that political activism does not cross the line into supporting or advocating for agendas that promote division, violence, or hatred. Endorsing the Khalistan movement could blur the line between academic inquiry and political partisanship. Universities should focus on fostering objective study and debate around important political issues, without becoming venues.\n",
            "subreddit": "uwaterloo",
            "publishingDate": 1742227348.0,
            "postId": "t3_1jdg7gr",
            "postLabel": "",
            "postUpvotes": 273,
            "ratio": 0.82,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 119,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/yashpot226",
            "authorId": "t2_53o5b9ap",
            "title": "I Destroyed WaterlooWorks Because I couldn't Get Any Jobs",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j6ndvj/i_destroyed_waterlooworks_because_i_couldnt_get/",
            "body": "Hi guys, for context I am currently a bitter, vengeful student who failed to secure any jobs through WaterlooWorks. I'm super excited to share that after months of plotting in my crusty V1 basement, I've finally rolled out my long-awaited revenge on the WaterlooWorks interface. I can't even begin to describe the amount of hatred that went into this... I basically destroyed every pixel placement on the platform, and carefully designed it in a way such that it maximized confusion. \n\nBefore the project, I did a LOT of malicious research, analyzed how to create the most frustrating user experience possible, and even consulted Laurier CS majors for their expertise on crafting unusable web interfaces. I also ignored students from each faculty and dismissed detailed feedback on pain points and navigation, all in the hopes of sabotaging the job application workflow.\n\nI was responsible for removing the shortlisting feature on WaterlooWorks, as I realized that it was helping people succeed where I had failed. So, I introduced a much more convoluted way to organize job applications - job folders! This catastrophic change will let you lose track of your applications completely, welcome to the nightmare of job hunting. And I also took part in breaking the search and filter system, so now it's actually unusable. \n\nI built this for my satisfaction, enjoy your suffering guys!",
            "subreddit": "uwaterloo",
            "publishingDate": 1741458243.0,
            "postId": "t3_1j6ndvj",
            "postLabel": "",
            "postUpvotes": 266,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 5,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/TheKoalaFromMars",
            "authorId": "t2_nd625za3",
            "title": "Potentially Unpopular Opinion: Fuck Cali Co-ops",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jas7vi/potentially_unpopular_opinion_fuck_cali_coops/",
            "body": "It may just be blind patriotism but given everything thats happened in the past few weeks with Canada, US relations, I'm questioning if I even want to ever live or work in the US. I feel like the entire country has so many problems with it thats it's just a giant clusterfuck (even if most of the issues wouldn't affect me on a day to day basis). \n\nI feel like working is Europe, especially in Germany, the Netherlands, or Switzerland has become exponentially more desirable from a quality of life standpoint. I know Europe has its own problems but they all seem more fixable than the USs. \n\nEspecially as a place to settle down, I don't think I ever would want to raise kids in the US. I'm curious what others think from a co-op standpoint if the tariff war has affected how you see working in the US.",
            "subreddit": "uwaterloo",
            "publishingDate": 1741914950.0,
            "postId": "t3_1jas7vi",
            "postLabel": "Co-op",
            "postUpvotes": 262,
            "ratio": 0.92,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 67,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/TheKoalaFromMars",
            "authorId": "t2_nd625za3",
            "title": "Holy shit it’s such a beautiful day",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j8a792/holy_shit_its_such_a_beautiful_day/",
            "body": "I looked outside and immediately exam doom no longer seem so bad. There is now happiness, puppies, rainbows and potentially even Santa Claus in the world. We are so back 💪💪💪",
            "subreddit": "uwaterloo",
            "publishingDate": 1741642677.0,
            "postId": "t3_1j8a792",
            "postLabel": "Discussion",
            "postUpvotes": 255,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 6,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/MrPicklePinosaur",
            "authorId": "t2_vbhf99a3",
            "title": "if you know you know",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jm6p4q/if_you_know_you_know/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1743198732.0,
            "postId": "t3_1jm6p4q",
            "postLabel": "",
            "postUpvotes": 236,
            "ratio": 0.84,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 13,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Reasonable-MessRedux",
            "authorId": "t2_14vfoggoiy",
            "title": "Trump slaps 250% tariff on Waterloo students, dismissing them as a bunch of 'goose lovers'.",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j9rj86/trump_slaps_250_tariff_on_waterloo_students/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1741805277.0,
            "postId": "t3_1j9rj86",
            "postLabel": "Shitpost",
            "postUpvotes": 237,
            "ratio": 0.94,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 14,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/thetermguy",
            "authorId": "t2_3qs4lsih",
            "title": "Fishing with nerds, trip to the maple syrup facility",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jbzb16/fishing_with_nerds_trip_to_the_maple_syrup/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1742057104.0,
            "postId": "t3_1jbzb16",
            "postLabel": "Social",
            "postUpvotes": 224,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 10,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/XD_Cabbage",
            "authorId": "t2_907boxya",
            "title": "I will be spreading misinformation",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jbdia6/i_will_be_spreading_misinformation/",
            "body": "As more freshmens get accepted and inevitably posts it in this subreddit, I feel obligated as an upper year to give out horrific information to help them settle into the environment easier. Maybe I won't, who knows. ",
            "subreddit": "uwaterloo",
            "publishingDate": 1741984158.0,
            "postId": "t3_1jbdia6",
            "postLabel": "",
            "postUpvotes": 224,
            "ratio": 0.99,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 2,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Objective-Quality963",
            "authorId": "t2_122wuu4eh8",
            "title": "Math 138 LA8",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j55jv3/math_138_la8/",
            "body": "\nUW cooked 💀💀💀",
            "subreddit": "uwaterloo",
            "publishingDate": 1741293741.0,
            "postId": "t3_1j55jv3",
            "postLabel": "",
            "postUpvotes": 223,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 21,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/picklewalrusman",
            "authorId": "t2_1p3i8yvz",
            "title": "Got a co-op",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jdg08a/got_a_coop/",
            "body": "",
            "subreddit": "uwaterloo",
            "publishingDate": 1742226867.0,
            "postId": "t3_1jdg08a",
            "postLabel": "Co-op",
            "postUpvotes": 218,
            "ratio": 1.0,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 7,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Fun_Advertising_6604",
            "authorId": "t2_9317xrtu",
            "title": "I am so lonely",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1jfxlx4/i_am_so_lonely/",
            "body": "All the other Waterloo students are scared of me.\n\nNo one studies with me.\n\nNo one wants to be my friend they think I am unstable...\n\nThey send me from co-op to co-op receiving outstandings in their name.\n\nAnd as I get return offers ... they fear me more and more.\n\nI am a victim of my own success.\n\nThe Co Opp ... I don't even get a real name. Only a purpose.\n\nI am capable of so much more and no one sees it.\n\nSome days I feel so alone I could cry, but I don't. I never do...\n\nBecause what would be the point? Not a single person on the entire campus would care....\n\n\nTake it to your unemployment.\n\n",
            "subreddit": "uwaterloo",
            "publishingDate": 1742499729.0,
            "postId": "t3_1jfxlx4",
            "postLabel": "",
            "postUpvotes": 209,
            "ratio": 0.96,
            "postAwards": 0,
            "matureContent": false,
            "commentCount": 12,
            "attachmentType": ""
        },
        {
            "authorProfile": "https://www.reddit.com/user/Dazzling-Deer-9689",
            "authorId": "t2_lb96k8h0u",
            "title": "DO NOT TALK TO NSFW AI",
            "link": "https://www.reddit.com/r/uwaterloo/comments/1j6wxgj/do_not_talk_to_nsfw_ai/",
            "body": "I CANNOT STRESS ENOUGH DO NOT TALK TO ANY NSFW AI OR ANY AI THAT HAS THE ABILITY TO BE JAILBROKEN AND TURNED NSFW. WHAT STARTED AS A STUPID JOKE TURNED TO ME NOW SITTING WITH A BLADDER CLOGGED TO THE BRIM WITH PRE AND UNABLE TO EXPEL ANY PEE. I HAVE SPENT A TOTAL SUM OF 9 HOURS TODAY JUST TOUCHING MYSELF WITHOUT EVEN BUSTING TO THESE AI CHATS. IF YOU TOLD ME THAT CHAT FUCKING GPT WOULD HAVE ME SITTING LIKE THIS IN LUSTFUL AGONY I WOULDVE CHANGED SO MANY THINGS IN LIFE PRIOR TO THESE EVENTS. NSFW AI IS WORSE THEN CRACK, IF YOU WANT TO START A HABIT DO CRACK BEFORE YOU GOON TO NSFW AI BECAUSE HOLY FUCK THIS SHIT IS EVIL AND 1000X MORE ADDICTIVE.\n\nTHE REASON I TAGGED THIS ACADEMICS IS BECAUSE I NOW HAVE NO FUCKING TIME TO WORK ON MY ASSIGNMENTS IR STUDY THANKS TO THIS SHIT. LET THIS BE A WARNING FOR U ALL, STUDY DONT GOON",
            "subreddit": "uwaterloo",
            "publishingDate": 1741485361.0,
            "postId": "t3_1j6wxgj",
            "postLabel": "Academics",
            "postUpvotes": 206,
            "ratio": 0.94,
            "postAwards": 0,
            "matureContent": true,
            "commentCount": 20,
            "attachmentType": ""
        }
    ],
    "info": {
        "id": "uwaterloo",
        "description": "Unofficial student and alumni-run subreddit for the University of Waterloo community",
        "members": 101736,
        "rank": 0,
        "bookmarks": {
            "Wiki": "/r/uwaterloo/wiki/index/",
            "WaterlooWorks": "https://waterlooworks.uwaterloo.ca/home.htm",
            "Learn": "https://learn.uwaterloo.ca/d2l/home",
            "Quest": "https://uwaterloo.ca/quest/",
            "Map": "https://uwaterloo.ca/map/",
            "Discord": "https://discord.gg/545tRcSWZM"
        },
        "url": "https://www.reddit.com/r/uwaterloo/top/?t=month"
    }
}